[{"changes":[{"en":"Completely redesigned the user interface to be fully compatible with smartphones and tablets, making it easier to use and more informative.","fr":"Refonte complète de l\u0027interface utilisateur pour la rendre entièrement compatible avec les smartphones et les tablettes, la rendant plus facile à utiliser et plus informative."},{"en":"Added a global inventory view for builds to quickly switch between inventory slots.","fr":"Ajout d\u0027une vue globale de l\u0027inventaire des équipements pour basculer rapidement entre les emplacements de l\u0027inventaire."},{"en":"Added a screen to view all existing items.","fr":"Ajout d\u0027un écran pour voir tous les objets existants."},{"en":"Added merchant Ref.","fr":"Ajout du marchand Ref."},{"en":"Added GP coins as a currency.","fr":"Ajout des pièces GP comme monnaie."},{"en":"Added the ability to filter builds by name and the items they contain.","fr":"Ajout de la possibilité de filtrer les équipements par nom et par les objets qu\u0027ils contiennent."},{"en":"Added the ability to filter items by type.","fr":"Ajout de la possibilité de filtrer les objets par type."},{"en":"Added the ability to select the default mods from a preset even when no configured merchant sell them.","fr":"Ajout de la possibilité de sélectionner les mods par défaut d\u0027une préconfiguration même si aucun des marchands configurés ne les vend."},{"en":"Changed the item selection list to display in red items that are incompatible with items already present in a build.","fr":"Modification de la liste de sélection des objets pour afficher en rouge les objets incompatibles avec les objets déjà présents dans un équipement."},{"en":"Mods are now retained when replacing an item with another item that has mod slots accepting the same mods.","fr":"Les mods sont désormais conservés lors du remplacement d\u0027un object par un autre object avec des emplacements de mods acceptant les mêmes mods."},{"en":"Replaced the \u0022Show items without merchant\u0022 option with the \u0022Show items not sold by selected merchants\u0022 option. This allows to select items not sold by the current merchants without having to change the entire merchant configuration.","fr":"Remplacement de l\u0027option \u0022Afficher les objets sans marchand\u0022 par l\u0027option \u0022Afficher les objets non vendus par les marchands sélectionnés\u0022. Cela permet de voir tous les objets non vendus par les marchands actuels sans avoir à modifier toute la configuration des marchands."},{"en":"Added automatic scrolling to the current item when opening the item selection list.","fr":"Ajout d\u0027un défilement automatique vers l\u0027object actuel quand on ouvre la liste de sélection des objets."},{"en":"Fixed the item selection list for armor mod slots to no longer display all existing armor plates.","fr":"Correction de la liste de sélection des objets pour les emplacements de mods d\u0027armure afin qu\u0027elle n\u0027affiche plus toutes les plaques d\u0027armure existantes."},{"en":"Added new item statistics.","fr":"Ajout de nouvelles statistiques d\u0027objets."},{"en":"Added social media buttons (Reddit, WhatsApp, Messenger, Telegram, Twitter, Bluesky, Facebook) to quickly share a build.","fr":"Ajout de boutons de réseaux sociaux (Reddit, WhatsApp, Messenger, Telegram, Twitter, Bluesky, Facebook) pour partager rapidement un équipement."},{"en":"Added buttons to quickly share a build via SMS or email.","fr":"Ajout de boutons pour partager rapidement un équipement par SMS ou par e-mail."},{"en":"Added build share links shortening using Spoo.me.","fr":"Ajout du raccourcissement des liens de partage d\u0027équipement en utilisant Spoo.me."},{"en":"Added advanced sharing options to manually share a text or markdown version of one or more builds at once (thanks to @Chem on Discord for the suggestion).","fr":"Ajout d\u0027options de partage avancées pour pouvoir partager manuellement une version texte ou markdown d\u0027un ou plusieurs équipements à la fois (merci à @Chem sur Discord pour la suggestion)."},{"en":"Added general options to manage notifications.","fr":"Ajout d\u0027options générales pour gérer les notifications."},{"en":"Fixed various bugs.","fr":"Correction de divers bugs."}],"date":"2025-07-16T02:00:00+02:00","version":"2.0.0"},{"changes":[{"en":"Added armor plate slots for items with armor. The front armor plate now determines the armor class of the item.","fr":"Ajout des emplacements de plaque d\u0027armures pour les objets avec armure. La plaque d\u0027armure frontale détermine maintenant la classe d\u0027armure de l\u0027objet."},{"en":"Added armor class display on builds and armor / tactical rig inventory slots.","fr":"Ajout de l\u0027affichage de la classe d\u0027armure sur les équipements et les emplacements d\u0027armure / gilet tactique de l\u0027inventaire."},{"en":"Added buttons for ignoring the price and displaying the stats, mods and content of an item .","fr":"Ajout de boutons pour ignorer le prix et afficher afficher les statistiques, mods et contenu d\u0027un objet."},{"en":"Fixed barters not being taken into account when determining item prices.","fr":"Correction des échanges qui n\u0027étaient pas pris en compte lors de la détermination du prix des objets."}],"date":"2024-04-27T02:00:00+02:00","version":"1.8.0"},{"changes":[{"en":"Updated existing builds to replace armored items by their new default preset. Old items now correspond to items without their armor plates.","fr":"Mise à jour des équipement existant pour remplacer les objets ayant de l\u0027armure par leur nouvelle préconfiguration par défaut. Les anciens objets correspondent maintenant aux objets sans leurs plaques d\u0027armure."}],"date":"2024-01-02T01:00:00+01:00","version":"1.7.1"},{"changes":[{"en":"Refactored the website backend to improve loading times.","fr":"Refonte de la partie serveur du site web pour améliorer les temps de chargement."}],"date":"2024-01-01T01:00:00+01:00","version":"1.7.0"},{"changes":[{"en":"Removed the \u0022Display options\u0022 button. Display options are now in the \u0022Options\u0022 sidebar (cog icon button).","fr":"Suppression du bouton \u0022Options d\u0027affichage\u0022. Les options d\u0027affichage sont maintenant dans le menu \u0022Options\u0022 (bouton avec icône de roue crantée)."},{"en":"Improved the \u0022Merchants \u0026 items\u0022 sidebar to automatically save changes when it is closed.","fr":"Amélioration du menu \u0022Merchants \u0026 items\u0022 pour sauvegarder automatiquement les changements lors de sa fermeture."},{"en":"Improved error handling.","fr":"Amélioration de la gestion des erreurs."},{"en":"Improved errors displayed to the user to be more understandable.","fr":"Amélioration des erreurs affichées à l\u0027utilisateur pour être plus compréhensibles."},{"en":"Improved and fixed various user interface elements.","fr":"Améliorations et correction de divers éléments de l\u0027interface utilisateur."}],"date":"2023-08-15T02:00:00+02:00","version":"1.6.5"}]