[{"changes":[{"language":"en","text":"Updated existing builds to replace armored items by their new default preset. Old items now correspond to items without their armor plates."},{"language":"fr","text":"Mise à jour des équipement existant pour remplacer les objets ayant de l\u0027armure par leur nouvelle préconfiguration par défaut. Les anciens objets correspondent maintenant aux objets sans leurs plaques d\u0027armure."}],"date":"2024-01-02T01:00:00+01:00","version":"1.7.1"},{"changes":[{"language":"en","text":"Refactored the website backend to improve loading times."},{"language":"fr","text":"Refonte de la partie serveur du site web pour améliorer les temps de chargement."}],"date":"2024-01-01T01:00:00+01:00","version":"1.7.0"},{"changes":[{"language":"en","text":"Removed the \u0022Display options\u0022 button. Display options are now in the \u0022Options\u0022 sidebar (cog icon button)."},{"language":"en","text":"Improved the \u0022Merchants \u0026 items\u0022 sidebar to automatically save changes when it is closed."},{"language":"en","text":"Improved error handling."},{"language":"en","text":"Improved errors displayed to the user to be more understandable."},{"language":"en","text":"Improved and fixed various user interface elements."},{"language":"fr","text":"Suppression du bouton \u0022Options d\u0027affichage\u0022. Les options d\u0027affichage sont maintenant dans le menu \u0022Options\u0022 (bouton avec icône de roue crantée)."},{"language":"fr","text":"Amélioration du menu \u0022Merchants \u0026 items\u0022 pour sauvegarder automatiquement les changements lors de sa fermeture."},{"language":"fr","text":"Amélioration de la gestion des erreurs."},{"language":"fr","text":"Amélioration des erreurs affichées à l\u0027utilisateur pour être plus compréhensibles."},{"language":"fr","text":"Améliorations et correction de divers éléments de l\u0027interface utilisateur."}],"date":"2023-08-15T02:00:00+02:00","version":"1.6.5"},{"changes":[{"language":"en","text":"Added various user interface improvements."},{"language":"en","text":"Improved default language detection."},{"language":"en","text":"Improved error detection."},{"language":"fr","text":"Ajout de diverses amélioration de l\u0027inteface graphique."},{"language":"fr","text":"Amélioration de la détection de la langue par défaut."},{"language":"fr","text":"Amélioration de la détection d\u0027erreurs."}],"date":"2023-07-30T02:00:00+02:00","version":"1.6.4"},{"changes":[{"language":"en","text":"Fixed quantity and price of barter items not being properly calculated in the shopping list."},{"language":"en","text":"Fixed item quantity not being properly updated when changing of selected item."},{"language":"fr","text":"Correction de la quantité et du prix des objets à échanger qui n\u0027étaient pas correctement calculés dans la liste de courses."},{"language":"fr","text":"Correction de la quantité d\u0027un objet sélectionné ne se mettant pas correctement à jour lorsqu\u0027on sélectionne un nouvel objet."}],"date":"2023-07-06T02:00:00+02:00","version":"1.6.3"}]