[{"changes":[{"language":"en","text":"Removed the \u0022Display options\u0022 button. Display options are now in the \u0022Options\u0022 sidebar (cog icon button)."},{"language":"en","text":"Improved the \u0022Merchants \u0026 items\u0022 sidebar to automatically save changes when it is closed."},{"language":"en","text":"Improved error handling."},{"language":"en","text":"Improved errors displayed to the user to be more understandable."},{"language":"en","text":"Improved and fixed various user interface elements."},{"language":"fr","text":"Suppression du bouton \u0022Options d\u0027affichage\u0022. Les options d\u0027affichage sont maintenant dans le menu \u0022Options\u0022 (bouton avec icône de roue crantée)."},{"language":"fr","text":"Amélioration du menu \u0022Merchants \u0026 items\u0022 pour sauvegarder automatiquement les changements lors de sa fermeture."},{"language":"fr","text":"Amélioration de la gestion des erreurs."},{"language":"fr","text":"Amélioration des erreurs affichées à l\u0027utilisateur pour être plus compréhensibles."},{"language":"fr","text":"Améliorations et correction de divers éléments de l\u0027interface utilisateur."}],"date":"2023-08-15T02:00:00+02:00","version":"1.6.5"},{"changes":[{"language":"en","text":"Added various user interface improvements."},{"language":"en","text":"Improved default language detection."},{"language":"en","text":"Improved error detection."},{"language":"fr","text":"Ajout de diverses amélioration de l\u0027inteface graphique."},{"language":"fr","text":"Amélioration de la détection de la langue par défaut."},{"language":"fr","text":"Amélioration de la détection d\u0027erreurs."}],"date":"2023-07-30T02:00:00+02:00","version":"1.6.4"},{"changes":[{"language":"en","text":"Fixed quantity and price of barter items not being properly calculated in the shopping list."},{"language":"en","text":"Fixed item quantity not being properly updated when changing of selected item."},{"language":"fr","text":"Correction de la quantité et du prix des objets à échanger qui n\u0027étaient pas correctement calculés dans la liste de courses."},{"language":"fr","text":"Correction de la quantité d\u0027un objet sélectionné ne se mettant pas correctement à jour lorsqu\u0027on sélectionne un nouvel objet."}],"date":"2023-07-06T02:00:00+02:00","version":"1.6.3"},{"changes":[{"language":"en","text":"Improved the item selection component performance and removed its maximum number of displayable items."},{"language":"en","text":"Improved the item search to be able to search using multiple words in any order."},{"language":"en","text":"Updated items that can contain other items to keep their content when changing the item."},{"language":"en","text":"Added the list of the required merchants for a build in the builds list and the shopping list."},{"language":"en","text":"Added the shopping list button in the builds list."},{"language":"en","text":"Added a lock icon on prices locked behind a quest."},{"language":"en","text":"Fixed various UI bugs and alignment problems."},{"language":"fr","text":"Amélioration de la performance du composant de sélection d\u0027objet et suppression de son nombre maximum d\u0027objets affichables."},{"language":"fr","text":"Amélioration de la recherche d\u0027objet afin de pouvoir chercher en utilisant plusieurs mots dans n\u0027importe quel ordre."},{"language":"fr","text":"Mise à jour des objets pouvant contenir d\u0027autres objets pour conserver leur contenu quand on change l\u0027objet."},{"language":"fr","text":"Ajout de la liste des marchands nécessaire à un équipement dans la liste des équipements et la liste de courses."},{"language":"fr","text":"Ajout du bouton de liste de courses dans la liste des équipements."},{"language":"fr","text":"Ajout d\u0027un icône de cadenas sur les prix nécessitant une quête."},{"language":"fr","text":"Correction de divers bugs graphiques et problème d\u0027alignement."}],"date":"2023-07-02T02:00:00+02:00","version":"1.6.2"},{"changes":[{"language":"en","text":"Added backpack ergonomics, movement speed and turning speed penalties."},{"language":"en","text":"Added movement speed and turning speed penalties on builds."},{"language":"fr","text":"Ajout des malus d\u0027ergonomie, de vitesse de déplacement et de vitesse de rotation sur les sacs à dos."},{"language":"fr","text":"Ajout des malus de vitesse de déplacement et de vitesse de rotation sur les équipements."}],"date":"2023-06-18T02:00:00+02:00","version":"1.6.1"}]